pages/4_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Design Project</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Design Project</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-SC-LED">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week 1</a></li>
      <li><a href="2_Lesson.html">Week 2</a></li>
      <li><a href="3_Lesson.html">Week 3</a></li>
      <li><a href="4_Lesson.html">Week 4</a></li>
      <li><a href="5_Lesson.html">Week 5</a></li>
      <li><a href="6_Lesson.html">Week 6</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Soldering</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Soldering stripboard isn't much harder than soldering a PCB. 
</li>
<li>The fundamental technique remains the same as always: Heat up the board and the component leg with the tip of the iron, apply a small amount of solder, then remove the iron. 
</li>
<li>Because your board consists of long thin strips, it can be easy to apply too much solder to the board, covering up other nearby holes you might need. It doesn't happen as often as you think it will, though!
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 make">
<h3 id="sec-1-2">Drill It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Once your teacher has approved your design start by obtaining a correctly sized piece of stripboard. We tend to use the 3-in-1 machine to trim to size. Your teacher can show you how to use this safely. 
</li>
<li>Next, drill your holes. <b>THIS IS THE MOST COMMON AREA TO GET WRONG</b>
</li>
<li>In DIYlc, you are seeing your PCB from the component side, <b>NOT THE SOLDER SIDE</b>. If on the computer you know you've got a hole to make in the top-left most hole in your stripboard, make sure the non-shiny side is facing up before you walk over to the drill. 
</li>
<li>Aside from drilling the board inverted, the next most common mistake is using the wrong-sized drill bits. To check bit-size, you can either measure the bit with a caliper, or see which is the smallest hole in the drill-bit storage box the bit will fit into. <b>Don't assume!</b>
</li>
<li><b>Tip:</b> Mark all your holes with a felt-tip pen or a board marker, and double-check them all before you use a drill. 
</li>
<li>Before moving on, check for&#x2026;
<ul class="org-ul">
<li>4x 1.5mm holes for your LEDs,
</li>
<li>2x 3mm holes for your M3 machine screws,
</li>
<li>2x 2mm holes for strain relief for your PP3 battery snap wire.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 make">
<h3 id="sec-1-3">Solder It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Solder in your 330 Ohm resistors first. Ensure they're nice and flat to the board, and all the right value. Sometimes, resistors from other drawers get muddled up, so make sure you've got orange, orange, brown,  gold on all of yours. 
</li>
<li>If you've got them all packed tightly together, you'll almost certainly find that the solder will clump togther on individual rows. This is fine. You've only got a problem if the solder forms a bridge from one row to the row above/below it. 
</li>
<li>After the resistors, add the PP3 battery clip (remember to use your strain relief holes). You'll need to de-solder the black wire in a future lesson if you're going to keep the battery outside of the case, but don't worry about this now.  
</li>
<li>Finally, add the LEDs. Start by using long-nose pliers to gently bend the + and - leg down by 90 degrees, so they will fit in the 1.5mm holes you created for them. The + and - are marked on the legs, but are absolutely tiny. You'll need excellent eyesight or a magnifying lens to see them. 
</li>
<li>Use the tip of a long-nose plier to gently coax each LED leg into its hole. The leg will sit a fraction of a millimeter above the copper on the solder-side of the board when in position. 
</li>
<li>Solder carefully, ensuring the LED leg is getting heated by the soldering iron as well as the copper board. Don't leave the iron on for too long or you'll burn out your LED. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 test">
<h3 id="sec-1-4">Test It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>- Test at 5V initially, to confifrm that your LEDs are both mounted the right way around. If you get alternate LEDs illuminating when you reverse the polarity of your power supply, you've gotten one soldered in backwards. While it might be tempteing, increasing the voltage beyond 9V will cause the LEDs to burn out within seconds.
</li>
<li><b>SAFETY NOTE:</b> These LEDs are very bright. Do not start directly into the light, and don't shine the LEDs into anyone else's eyes, as this will cause discomfort. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Badge It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>You will be assessed as follows:
</li>
<li><b>Silver:</b> Evidence of some stripboard soldering.
</li>
<li><b>Gold:</b> 1x Working LED with correct resistors.
</li>
<li><b>Platinum:</b> Neat, fully functioning PCB.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
